---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ThermalMaterialParamTransmitsLight
source: html/685dffd6-bc08-4931-5de6-ca91a6a18d0e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ThermalMaterialParamTransmitsLight Property

"Transmits Light"

## Syntax (C#)
```csharp
public static ForgeTypeId ThermalMaterialParamTransmitsLight { get; }
```